tiborsimon/embedded-tdd-headers/pic/pic18/pic18lf25j11_tdd.h
#define WAITM2                        522
#define WAITM3                        523
#define WAITB0                        524
#define WAITB1                        525
#define T1GCON                        526
#define T1GSS0                        527
#define T1GSS1                        528
#define T1GVAL                        529
#define T1DONE                        530
#define T1GGO_T1DONE                  531
#define T1GGO                         532
#define T1GSPM                        533
#define T1GTM                         534
#define T1GPOL                        535
#define TMR1GE                        536
#define OSCTUNE                       537
#define TUN0                          538
#define TUN                           539
#define TUN1                          540
#define TUN2                          541
#define TUN3                          542
#define TUN4                          543
#define TUN5                          544
#define PLLEN                         545
#define INTSRC                        546
#define RCSTA2                        547
#define RCD82                         548
#define RX9D2                         549
#define RCSTA2_RX9D                   550
#define OERR2                         551
#define RCSTA2_OERR                   552
#define FERR2                         553
#define RCSTA2_FERR                   554
#define ADDEN2                        555
#define RCSTA2_ADDEN                  556
#define RCSTA2_CREN                   557
#define CREN2                         558
#define SREN2                         559
#define RCSTA2_SREN                   560
#define RC92                          561
#define RC8_92                        562
#define RCSTA2_RX9                    563
#define RX92                          564
#define RCSTA2_SPEN                   565
#define SPEN2                         566
#define PIE1                          567
#define TMR1IE                        568
#define TMR2IE                        569
#define CCP1IE                        570
#define SSP1IE                        571
#define SSPIE                         572
#define TXIE                          573
#define TX1IE                         574
#define RC1IE                         575
#define RCIE                          576
#define ADIE                          577
#define PIR1                          578
#define TMR1IF                        579
#define TMR2IF                        580
#define CCP1IF                        581
#define SSPIF                         582
#define SSP1IF                        583
#define TXIF                          584
#define TX1IF                         585
#define RCIF                          586
#define RC1IF                         587
#define ADIF                          588
#define IPR1                          589
#define TMR1IP                        590
#define TMR2IP                        591
#define CCP1IP                        592
#define SSPIP                         593
#define SSP1IP                        594
#define TX1IP                         595
#define TXIP                          596
#define RCIP                          597
#define RC1IP                         598
#define ADIP                          599
#define PIE2                          600
#define CCP2IE                        601
#define TMR3IE                        602
#define LVDIE                         603
#define BCL1IE                        604
#define BCLIE                         605
#define CM1IE                         606
#define CMIE                          607
#define CM2IE                         608
#define OSCFIE                        609
#define PIR2                          610
#define CCP2IF                        611
#define TMR3IF                        612
#define LVDIF                         613
#define BCL1IF                        614
#define BCLIF                         615
#define CM1IF                         616
#define CMIF                          617
#define CM2IF                         618
#define OSCFIF                        619
#define IPR2                          620
#define CCP2IP                        621
#define TMR3IP                        622
#define LVDIP                         623
#define BCLIP                         624
#define BCL1IP                        625
#define CM1IP                         626
#define CM2IP                         627
#define CMIP                          628
#define OSCFIP                        629
#define PIE3                          630
#define RTCCIE                        631
#define RXB0IE                        632
#define RXBNIE                        633
#define TMR3GIE                       634
#define RXB1IE                        635
#define CTMUIE                        636
#define TXB0IE                        637
#define TMR4IE                        638
#define TXB1IE                        639
#define TXB2IE                        640
#define TXBNIE                        641
#define TX2IE                         642
#define RC2IE                         643
#define BCL2IE                        644
#define SSP2IE                        645
#define PIR3                          646
#define RTCCIF                        647
#define RXBNIF                        648
#define TMR3GIF                       649
#define CTMUIF                        650
#define TMR4IF                        651
#define TXBNIF                        652
#define TX2IF                         653
#define RC2IF                         654
#define BCL2IF                        655
#define SSP2IF                        656
#define IPR3                          657
#define RTCCIP                        658
#define TMR3GIP                       659
#define RXBNIP                        660
#define CTMUIP                        661
#define TMR4IP                        662
#define TX2IP                         663
#define TXBNIP                        664
#define RC2IP                         665
#define BCL2IP                        666
#define SSP2IP                        667
#define EECON1                        668
#define WR                            669
#define WREN                          670
#define WRERR                         671
#define FREE                          672
#define WPROG                         673
#define EECON2                        674
#define TXSTA2                        675
#define TX9D2                         676
#define TXSTA2_TX9D                   677
#define TXD82                         678
#define TRMT2                         679
#define TXSTA2_TRMT                   680
#define BRGH2                         681
#define TXSTA2_BRGH                   682
#define SENDB2                        683
#define TXSTA2_SENDB                  684
#define TXSTA2_SYNC                   685
#define SYNC2                         686
#define TXEN2                         687
#define TXSTA2_TXEN                   688
#define TX8_92                        689
#define TX92                          690
#define TXSTA2_TX9                    691
#define TXSTA2_CSRC                   692
#define CSRC2                         693
#define TXREG2                        694
#define RCREG2                        695
#define SPBRG2                        696
#define RCSTA1                        697
#define RCSTA1_RX9D                   698
#define RX9D1                         699
#define RCD8                          700
#define RCSTA1_OERR                   701
#define OERR1                         702
#define RCSTA1_FERR                   703
#define FERR1                         704
#define RCSTA1_ADDEN                  705
#define ADDEN1                        706
#define ADEN                          707
#define RCSTA1_CREN                   708
#define CREN1                         709
#define SRENA                         710
#define SREN1                         711
#define RCSTA1_SREN                   712
#define RC8_9                         713
#define RCSTA1_RX9                    714
#define nRC8                          715
#define NOT_RC8                       716
#define RC9                           717
#define RX91                          718
#define RCSTA1_SPEN                   719
#define SPEN1                         720
#define TXSTA1                        721
#define TX9D1                         722
#define TXSTA1_TX9D                   723
#define TXD8                          724
#define TRMT1                         725
#define TXSTA1_TRMT                   726
#define BRGH1                         727
#define TXSTA1_BRGH                   728
#define TXSTA1_SENDB                  729
#define SENDB1                        730
#define TXSTA1_SYNC                   731
#define SYNC1                         732
#define TXEN1                         733
#define TXSTA1_TXEN                   734
#define TX91                          735
#define TX8_9                         736
#define NOT_TX8                       737
#define nTX8                          738
#define TXSTA1_TX9                    739
#define TXSTA1_CSRC                   740
#define CSRC1                         741
#define TXREG1                        742
#define RCREG1                        743
#define SPBRG1                        744
#define CTMUICON                      745
#define IRNG                          746
#define IRNG0                         747
#define IRNG1                         748
#define ITRIM0                        749
#define ITRIM                         750
#define ITRIM1                        751
#define ITRIM2                        752
#define ITRIM3                        753
#define ITRIM4                        754
#define ITRIM5                        755
#define CTMUCONL                      756
#define EDG1STAT                      757
#define EDG2STAT                      758
#define EDG1SEL                       759
#define EDG1SEL0                      760
#define EDG1SEL1                      761
#define EDG1POL                       762
#define EDG2SEL0                      763
#define EDG2SEL                       764
#define EDG2SEL1                      765
#define EDG2POL                       766
#define CTMUCONH                      767
#define CTTRIG                        768
#define IDISSEN                       769
#define EDGSEQEN                      770
#define EDGEN                         771
#define TGEN                          772
#define CTMUSIDL                      773
#define CTMUEN                        774
#define CCP2CON                       775
#define CCP2M                         776
#define CCP2M0                        777
#define CCP2M1                        778
#define CCP2M2                        779
#define CCP2M3                        780
#define DC2B                          781
#define DC2B0                         782
#define CCP2Y                         783
#define DC2B1                         784
#define CCP2X                         785
#define P2M                           786
#define P2M0                          787
#define P2M1                          788
#define CCPR2L                        789
#define CCPR2H                        790
#define ECCP2DEL                      791
#define ECCP2DEL_P2DC0                792
#define P2DC                          793
#define ECCP2DEL_P2DC1                794
#define ECCP2DEL_P2DC2                795
#define ECCP2DEL_P2DC3                796
#define ECCP2DEL_P2DC4                797
#define ECCP2DEL_P2DC5                798
#define ECCP2DEL_P2DC6                799
#define P2RSEN                        800
#define PSS2BD                        801
#define PSS2BD0                       802
#define PSS2BD1                       803
#define PSS2AC0                       804
#define PSS2AC                        805
#define PSS2AC1                       806
#define ECCP2AS0                      807
#define ECCP2AS                       808
#define ECCP2AS1                      809
#define ECCP2AS2                      810
#define ECCP2ASE                      811
#define PSTR2CON                      812
#define PSTR2CON_STRA                 813
#define P2DC02                        814
#define STRA2                         815
#define P2DC0CON                      816
#define PSTR2CON_P2DC0                817
#define STRB2                         818
#define P2DC12                        819
#define PSTR2CON_STRB                 820
#define PSTR2CON_P2DC1                821
#define P2DC1CON                      822
#define PSTR2CON_STRC                 823
#define STRC2                         824
#define PSTR2CON_P2DC2                825
#define P2DC22                        826
#define P2DC2CON                      827
#define P2DC32                        828
#define STRD2                         829
#define PSTR2CON_STRD                 830
#define P2DC3CON                      831
#define PSTR2CON_P2DC3                832
#define P2DC4CON                      833
#define STRSYNC2                      834
#define PSTR2CON_STRSYNC              835
#define PSTR2CON_P2DC4                836
#define P2DC42                        837
#define P2DC52                        838
#define P2DC5CON                      839
#define PSTR2CON_P2DC5                840
#define P2DC6CON                      841
#define CMPL02                        842
#define PSTR2CON_P2DC6                843
#define P2DC62                        844
#define PSTR2CON_CMPL0                845
#define CMPL12                        846
#define PSTR2CON_CMPL1                847
#define CCP1CON                       848
#define CCP1M0                        849
#define CCP1M                         850
#define CCP1M1                        851
#define CCP1M2                        852
#define CCP1M3                        853
#define CCP1Y                         854
#define DC1B                          855
#define DC1B0                         856
#define CCP1X                         857
#define DC1B1                         858
#define P1M                           859
#define P1M0                          860
#define P1M1                          861
#define CCPR1L                        862
#define CCPR1H                        863
#define ECCP1DEL                      864
#define P1DC                          865
#define P1DC0                         866
#define P1DC1                         867
#define P1DC2                         868
#define P1DC3                         869
#define P1DC4                         870
#define P1DC5                         871
#define P1DC6                         872
#define P1RSEN                        873
#define PSS1BD0                       874
#define PSS1BD                        875
#define PSS1BD1                       876
#define PSS1AC                        877
#define PSS1AC0                       878
#define PSS1AC1                       879
#define ECCP1AS                       880
#define ECCP1AS0                      881
#define ECCP1AS1                      882
#define ECCP1AS2                      883
#define ECCP1ASE                      884
#define PSTR1CON                      885
#define PSTR1CON_STRA                 886
#define PSTR1CON_STRB                 887
#define PSTR1CON_STRC                 888
#define PSTR1CON_STRD                 889
#define PSTR1CON_STRSYNC              890
#define PSTR1CON_CMPL0                891
#define PSTR1CON_CMPL1                892
#define WDTCON                        893
#define SWDTEN                        894
#define SWDTE                         895
#define ULPSINK                       896
#define ULPEN                         897
#define DS                            898
#define ULPLVL                        899
#define LVDSTAT                       900
#define REGSLP                        901
#define ADCON1                        902
#define ADCS0                         903
#define ADCS                          904
#define ADCS1                         905
#define ADCS2                         906
#define ACQT0                         907
#define ACQT                          908
#define CHSN3                         909
#define ACQT1                         910
#define VCFG01                        911
#define ACQT2                         912
#define VCFG11                        913
#define ADCON1_ADCAL                  914
#define ADFM                          915
#define ADCON0                        916
#define ADON                          917
#define nDONE                         918
#define GO_nDONE                      919
#define NOT_DONE                      920
#define GODONE                        921
#define GO_DONE                       922
#define DONE                          923
#define GO                            924
#define GO_NOT_DONE                   925
#define CHS                           926
#define CHS0                          927
#define CHS1                          928
#define CHS2                          929
#define CHS3                          930
#define VCFG                          931
#define VCFG0                         932
#define VCFG1                         933
#define ADCON0_ADCAL                  934
#define ADRESL                        935
#define ADRESH                        936
#define SSP1CON2                      937
#define SEN1                          938
#define SSP1CON2_SEN                  939
#define ADMSK11                       940
#define SSP1CON2_RSEN                 941
#define RSEN1                         942
#define SSP1CON2_ADMSK1               943
#define SSP1CON2_PEN                  944
#define ADMSK21                       945
#define PEN1                          946
#define SSP1CON2_ADMSK2               947
#define ADMSK31                       948
#define RCEN1                         949
#define SSP1CON2_RCEN                 950
#define SSP1CON2_ADMSK3               951
#define SSP1CON2_ACKEN                952
#define ACKEN1                        953
#define ADMSK41                       954
#define SSP1CON2_ADMSK4               955
#define ACKDT1                        956
#define ADMSK51                       957
#define SSP1CON2_ACKDT                958
#define SSP1CON2_ADMSK5               959
#define SSP1CON2_ACKSTAT              960
#define ACKSTAT1                      961
#define GCEN1                         962
#define SSP1CON2_GCEN                 963
#define SSP1CON1                      964
#define SSP1CON1_SSPM0                965
#define SSPM01                        966
#define SSP1CON1_SSPM                 967
#define SSP1CON1_SSPM1                968
#define SSPM11                        969
#define SSP1CON1_SSPM2                970
#define SSPM21                        971
#define SSPM31                        972
#define SSP1CON1_SSPM3                973
#define SSP1CON1_CKP                  974
#define CKP1                          975
#define SSPEN1                        976
#define SSP1CON1_SSPEN                977
#define SSPOV1                        978
#define SSP1CON1_SSPOV                979
#define WCOL1                         980
#define SSP1CON1_WCOL                 981
#define SSP1STAT                      982
#define BF1                           983
#define SSP1STAT_BF                   984
#define SSP1STAT_UA                   985
#define UA1                           986
#define SSP1STAT_R_NOT_W              987
#define READ_WRITE                    988
#define RW1                           989
#define NOT_W                         990
#define I2C_READ                      991
#define nW                            992
#define RW                            993
#define nWRITE                        994
#define R                             995
#define NOT_WRITE                     996
#define R_W                           997
#define SSP1STAT_R_nW                 998
#define SSP1STAT_S                    999
#define START                         1000
#define START1                        1001
#define I2C_START                     1002
#define STOP                          1003
#define SSP1STAT_P                    1004
#define STOP1                         1005
#define I2C_STOP                      1006
#define SSP1STAT_D_NOT_A              1007
#define NOT_A                         1008
#define SSP1STAT_D_nA                 1009
#define nA                            1010
#define D_A                           1011
#define D                             1012
#define DA1                           1013
#define DA                            1014
#define DATA_ADDRESS                  1015
#define NOT_ADDRESS                   1016
#define nADDRESS                      1017
#define I2C_DAT                       1018
#define SSP1STAT_CKE                  1019
#define CKE1                          1020
#define SSP1STAT_SMP                  1021
#define SMP1                          1022
#define SSP1ADD                       1023
#define SSP1ADD_SSPADD                1024
#define SSP1ADD_MSK0                  1025
#define MSK01                         1026
#define SSP1ADD_MSK1                  1027
#define MSK11                         1028
#define SSP1ADD_MSK2                  1029
#define MSK21                         1030
#define MSK31                         1031
#define SSP1ADD_MSK3                  1032
#define SSP1ADD_MSK4                  1033
#define MSK41                         1034
#define MSK51                         1035
#define SSP1ADD_MSK5                  1036
#define SSP1ADD_MSK6                  1037
#define MSK61                         1038
#define MSK71                         1039
#define SSP1ADD_MSK7                  1040
#define SSP1BUF                       1041
#define SSP1BUF_SSPBUF                1042
#define T2CON                         1043
#define T2CKPS0                       1044
#define T2CKPS                        1045
#define T2CKPS1                       1046
#define TMR2ON                        1047
#define T2OUTPS0                      1048
#define T2OUTPS                       1049
#define T2OUTPS1                      1050
#define T2OUTPS2                      1051
#define T2OUTPS3                      1052
#define WM0                           1053
#define PR2                           1054
#define WM1                           1055
#define WAIT0                         1056
#define WAIT1                         1057
#define EBDIS                         1058
#define TMR2                          1059
#define T1CON                         1060
#define TMR1ON                        1061
#define T1CON_RD16                    1062
#define T1SYNC                        1063
#define T1OSCEN                       1064
#define SOSCEN                        1065
#define T1CKPS0                       1066
#define T1CKPS                        1067
#define T1CKPS1                       1068
#define TMR1CS0                       1069
#define TMR1CS                        1070
#define T1RD16                        1071
#define TMR1CS1                       1072
#define TMR1L                         1073
#define TMR1H                         1074
#define RCON                          1075
#define BOR                           1076
#define NOT_BOR                       1077
#define nBOR                          1078
#define POR                           1079
#define nPOR                          1080
#define NOT_POR                       1081
#define PD                            1082
#define nPD                           1083
#define NOT_PD                        1084
#define nTO                           1085
#define TO                            1086
#define NOT_TO                        1087
#define nRI                           1088
#define NOT_RI                        1089
#define RI                            1090
